###Introduction

This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the <a href="https://pandas.pydata.org/docs/user_guide/cookbook.html#cookbook" target="_blank">Cookbook<a/>.

Customarily, we import as follows:

In [1]:
import numpy as np
import pandas as pd

## Object Creation

See the <a target="_blank" href="https://pandas.pydata.org/docs/user_guide/dsintro.html#dsintro">Intro to data structures section</a>.

Creating a <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.Series.html#pandas.Series">`Series`</a> by passing a list of values, letting pandas create a default integer index:

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

# the default integer index is like in a list. but you can supply it an index of anything.

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame">`DataFrame`</a> by passing a NumPy array, with a datetime index using <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.date_range.html#pandas.date_range">`date_range()`</a> and labeled columns:

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

# creates a dataframe where:
# index = row names 
# columns = listed as columns
# (6,4) --> an array of shape 6x4, normally distributed mean 0, var 1

                   A         B         C         D
2013-01-01  0.321983  1.329344  0.471810  0.735881
2013-01-02 -0.518337  0.347907 -0.926087  0.955489
2013-01-03  1.503177  0.616035 -0.698710  0.791975
2013-01-04  1.493350  0.586334 -0.789059 -0.006325
2013-01-05  1.828942 -0.346639  0.871194 -0.821000
2013-01-06 -0.395603 -0.293618 -0.795951  0.279765

Creating a <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame">`DataFrame`</a> by passing a dictionary of objects that can be converted into a series-like structure:

In [5]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

# the A-F are the columns 
# indices are automatically assigned

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

The columns of the resulting <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame">`DataFrame`</a> have different <a target="_blank" href="https://pandas.pydata.org/docs/user_guide/basics.html#basics-dtypes">`dtypes`</a>:

In [6]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

If youâ€™re using an interactive tool with automatic completion for column names, hereâ€™s a subset of the attributes that will be completed:
```
df2.<TAB>
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.columns
df2.align              df2.copy
df2.all                df2.count
df2.any                df2.combine
df2.append             df2.D
df2.apply              df2.describe
df2.applymap           df2.diff
df2.B                  df2.duplicated
```
As you can see, the columns `A`, `B`, `C`, and `D` are automatically tab completed. `E` and `F` are there as well; the rest of the attributes have been truncated for brevity.

In [18]:
df2.bool

<bound method NDFrame.bool of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

## Viewing data

See the <a target="_blank" href="https://pandas.pydata.org/docs/user_guide/basics.html#basics">Basics section</a>.

Use <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.head.html#pandas.DataFrame.head">`DataFrame.head()`</a> and <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.tail.html#pandas.DataFrame.tail">`DataFrame.tail()`</a> to view the top and bottom rows of the frame respectively:

In [19]:
df.head()

                   A         B         C         D
2013-01-01  0.321983  1.329344  0.471810  0.735881
2013-01-02 -0.518337  0.347907 -0.926087  0.955489
2013-01-03  1.503177  0.616035 -0.698710  0.791975
2013-01-04  1.493350  0.586334 -0.789059 -0.006325
2013-01-05  1.828942 -0.346639  0.871194 -0.821000

In [20]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.493350  0.586334 -0.789059 -0.006325
2013-01-05  1.828942 -0.346639  0.871194 -0.821000
2013-01-06 -0.395603 -0.293618 -0.795951  0.279765

Display the <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.index.html#pandas.DataFrame.index">`DataFrame.index`</a> or <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.columns.html#pandas.DataFrame.columns">`DataFrame.columns`</a>:

In [23]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

<a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_numpy.html#pandas.DataFrame.to_numpy">`DataFrame.to_numpy()`</a> gives a NumPy representation of the underlying data. Note that this can be an expensive operation when your <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame">`DataFrame`</a> has columns with different data types, which comes down to a fundamental difference between pandas and NumPy: **NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column**. When you call <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_numpy.html#pandas.DataFrame.to_numpy">`DataFrame.to_numpy()`</a>, pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. This may end up being `object`, which requires casting every value to a Python object.

For `df`, our <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame">`DataFrame`</a> of all floating-point values, and <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_numpy.html#pandas.DataFrame.to_numpy">`DataFrame.to_numpy()`</a> is fast and doesnâ€™t require copying data:

In [25]:
df.to_numpy()  # gives a NumPy representation of the dataframe data

array([[ 0.3219829 ,  1.32934379,  0.47180962,  0.73588084],
       [-0.51833702,  0.34790723, -0.92608714,  0.95548885],
       [ 1.50317686,  0.61603535, -0.69871012,  0.79197488],
       [ 1.49335003,  0.5863339 , -0.789059  , -0.00632494],
       [ 1.82894159, -0.34663853,  0.87119371, -0.82100039],
       [-0.39560262, -0.29361837, -0.7959512 ,  0.27976454]])

For `df2`, the <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame">`DataFrame`</a> with multiple dtypes, <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_numpy.html#pandas.DataFrame.to_numpy">`DataFrame.to_numpy()`</a> is relatively expensive:

In [26]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

NOTE: <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_numpy.html#pandas.DataFrame.to_numpy">`DataFrame.to_numpy()`</a> does not include the index or column labels in the output.

<a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.describe.html#pandas.DataFrame.describe">`describe()`</a> shows a quick statistic summary of your data:

In [27]:
df.describe()  # summary statistics! cool

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.705585  0.373227 -0.311134  0.322631
std    1.036958  0.629613  0.774951  0.664757
min   -0.518337 -0.346639 -0.926087 -0.821000
25%   -0.216206 -0.133237 -0.794228  0.065197
50%    0.907666  0.467121 -0.743885  0.507823
75%    1.500720  0.608610  0.179180  0.777951
max    1.828942  1.329344  0.871194  0.955489

Transposing your data:

In [28]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.321983   -0.518337    1.503177    1.493350    1.828942   -0.395603
B    1.329344    0.347907    0.616035    0.586334   -0.346639   -0.293618
C    0.471810   -0.926087   -0.698710   -0.789059    0.871194   -0.795951
D    0.735881    0.955489    0.791975   -0.006325   -0.821000    0.279765

<a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_index.html#pandas.DataFrame.sort_index">`DataFrame.sort_index()`</a> sorts by an axis:

In [ ]:
df.sort_index(axis=0, ascending=False)

# axis means the index of the rows or index of the columns 
# 0 = row index
# 1 = column index

                   A         B         C         D
2013-01-06 -0.395603 -0.293618 -0.795951  0.279765
2013-01-05  1.828942 -0.346639  0.871194 -0.821000
2013-01-04  1.493350  0.586334 -0.789059 -0.006325
2013-01-03  1.503177  0.616035 -0.698710  0.791975
2013-01-02 -0.518337  0.347907 -0.926087  0.955489
2013-01-01  0.321983  1.329344  0.471810  0.735881

<a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html#pandas.DataFrame.sort_values">`DataFrame.sort_values()`</a> sorts by values:

In [35]:
df.sort_values(by='B')
# sorts by the column header specified here

                   A         B         C         D
2013-01-05  1.828942 -0.346639  0.871194 -0.821000
2013-01-06 -0.395603 -0.293618 -0.795951  0.279765
2013-01-02 -0.518337  0.347907 -0.926087  0.955489
2013-01-04  1.493350  0.586334 -0.789059 -0.006325
2013-01-03  1.503177  0.616035 -0.698710  0.791975
2013-01-01  0.321983  1.329344  0.471810  0.735881

#### ðŸ‘‰ Save your work here

## Selection

NOTE: While standard Python / NumPy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.at.html#pandas.DataFrame.at">`DataFrame.at()`</a>, <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.iat.html#pandas.DataFrame.iat">`DataFrame.iat()`</a>, <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html#pandas.DataFrame.loc">`DataFrame.loc()`</a> and <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.iloc.html#pandas.DataFrame.iloc">`DataFrame.iloc()`</a>.

See the indexing documentation <a target="_blank" href="https://pandas.pydata.org/docs/user_guide/indexing.html#indexing">Indexing and Selecting Data</a> and <a target="_blank" href="https://pandas.pydata.org/docs/user_guide/advanced.html#advanced">MultiIndex / Advanced Indexing</a>.

### Getting

Selecting a single column, which yields a <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.Series.html#pandas.Series">`Series`</a>, equivalent to `df.A`:

In [36]:
df["A"]

2013-01-01    0.321983
2013-01-02   -0.518337
2013-01-03    1.503177
2013-01-04    1.493350
2013-01-05    1.828942
2013-01-06   -0.395603
Freq: D, Name: A, dtype: float64

In [37]:
df.A

2013-01-01    0.321983
2013-01-02   -0.518337
2013-01-03    1.503177
2013-01-04    1.493350
2013-01-05    1.828942
2013-01-06   -0.395603
Freq: D, Name: A, dtype: float64

Selecting via `[]` (`__getitem__`), which slices the rows:

In [38]:
df[0:3]  # only the first 3 rows

                   A         B         C         D
2013-01-01  0.321983  1.329344  0.471810  0.735881
2013-01-02 -0.518337  0.347907 -0.926087  0.955489
2013-01-03  1.503177  0.616035 -0.698710  0.791975

In [39]:
df["20130102":"20130104"]  # you can slice by index too if you know it

                   A         B         C         D
2013-01-02 -0.518337  0.347907 -0.926087  0.955489
2013-01-03  1.503177  0.616035 -0.698710  0.791975
2013-01-04  1.493350  0.586334 -0.789059 -0.006325

### Selection by label

See more in <a target="_blank" href="https://pandas.pydata.org/docs/user_guide/indexing.html#indexing-label">Selection by Label</a> using <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html#pandas.DataFrame.loc">`DataFrame.loc()`</a> or <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.at.html#pandas.DataFrame.at">`DataFrame.at()`</a>.

For getting a cross section using a label:

In [40]:
df.loc[dates[0]]  # so this gets the first cross section - by the first date

A    0.321983
B    1.329344
C    0.471810
D    0.735881
Name: 2013-01-01 00:00:00, dtype: float64

In [41]:
df

                   A         B         C         D
2013-01-01  0.321983  1.329344  0.471810  0.735881
2013-01-02 -0.518337  0.347907 -0.926087  0.955489
2013-01-03  1.503177  0.616035 -0.698710  0.791975
2013-01-04  1.493350  0.586334 -0.789059 -0.006325
2013-01-05  1.828942 -0.346639  0.871194 -0.821000
2013-01-06 -0.395603 -0.293618 -0.795951  0.279765

Selecting on a multi-axis by label:

In [42]:
df.loc[:, ["A", "B"]]  # this grabs all rows, and only columns A and B

                   A         B
2013-01-01  0.321983  1.329344
2013-01-02 -0.518337  0.347907
2013-01-03  1.503177  0.616035
2013-01-04  1.493350  0.586334
2013-01-05  1.828942 -0.346639
2013-01-06 -0.395603 -0.293618

Showing label slicing, both endpoints are included:

In [43]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.518337  0.347907
2013-01-03  1.503177  0.616035
2013-01-04  1.493350  0.586334

Reduction in the dimensions of the returned object:

In [44]:
df.loc["20130102", ["A", "B"]]

A   -0.518337
B    0.347907
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value:

In [45]:
df.loc[dates[0], "A"]  # gets 1 value

0.3219828997215635

For getting fast access to a scalar (equivalent to the prior method):

In [46]:
df.at[dates[0], "A"] 
# best for accessing a single cell by label 
# faster than .loc for single value retrival 
# does not support multiple rows.columns

0.3219828997215635

### Selection by position

See more in <a target="_blank" href="https://pandas.pydata.org/docs/user_guide/indexing.html#indexing-integer">Selection by Position</a> using <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.iloc.html#pandas.DataFrame.iloc">`DataFrame.iloc()`</a> or <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.at.html#pandas.DataFrame.at">`DataFrame.at()`</a>.

Select via the position of the passed integers:

In [48]:
df

                   A         B         C         D
2013-01-01  0.321983  1.329344  0.471810  0.735881
2013-01-02 -0.518337  0.347907 -0.926087  0.955489
2013-01-03  1.503177  0.616035 -0.698710  0.791975
2013-01-04  1.493350  0.586334 -0.789059 -0.006325
2013-01-05  1.828942 -0.346639  0.871194 -0.821000
2013-01-06 -0.395603 -0.293618 -0.795951  0.279765

In [47]:
df.iloc[3]
# 0 based
# so spits out the 4th row

A    1.493350
B    0.586334
C   -0.789059
D   -0.006325
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to NumPy/Python:

In [49]:
df.iloc[3:5, 0:2]  # row, column 
# doesn't call the names specifically, calls by location

                   A         B
2013-01-04  1.493350  0.586334
2013-01-05  1.828942 -0.346639

By lists of integer position locations, similar to the NumPy/Python style:

In [50]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.518337 -0.926087
2013-01-03  1.503177 -0.698710
2013-01-05  1.828942  0.871194

For slicing rows explicitly:

In [51]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.518337  0.347907 -0.926087  0.955489
2013-01-03  1.503177  0.616035 -0.698710  0.791975

For slicing columns explicitly:

In [52]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.329344  0.471810
2013-01-02  0.347907 -0.926087
2013-01-03  0.616035 -0.698710
2013-01-04  0.586334 -0.789059
2013-01-05 -0.346639  0.871194
2013-01-06 -0.293618 -0.795951

For getting a value explicitly:

In [53]:
df.iloc[1, 1]

0.3479072318062564

For getting fast access to a scalar (equivalent to the prior method):

In [54]:
df.iat[1, 1]

0.3479072318062564

### Boolean indexing

Using a single columnâ€™s values to select data:

In [57]:
df

                   A         B         C         D
2013-01-01  0.321983  1.329344  0.471810  0.735881
2013-01-02 -0.518337  0.347907 -0.926087  0.955489
2013-01-03  1.503177  0.616035 -0.698710  0.791975
2013-01-04  1.493350  0.586334 -0.789059 -0.006325
2013-01-05  1.828942 -0.346639  0.871194 -0.821000
2013-01-06 -0.395603 -0.293618 -0.795951  0.279765

In [55]:
df[df["A"] > 0]

# boolean indexing! really cool! 
# spit out everything where the value in column A > 0 

# returns a boolean series whether each value in column A > 0 
# df is filtered to only include rows where column A > 0 is True

                   A         B         C         D
2013-01-01  0.321983  1.329344  0.471810  0.735881
2013-01-03  1.503177  0.616035 -0.698710  0.791975
2013-01-04  1.493350  0.586334 -0.789059 -0.006325
2013-01-05  1.828942 -0.346639  0.871194 -0.821000

Selecting values from a DataFrame where a boolean condition is met:

In [ ]:
df[df > 0]

# returns a df of the same shape
# replaces values that don't meet conditions with NaN
# no filtering

                   A         B         C         D
2013-01-01  0.321983  1.329344  0.471810  0.735881
2013-01-02       NaN  0.347907       NaN  0.955489
2013-01-03  1.503177  0.616035       NaN  0.791975
2013-01-04  1.493350  0.586334       NaN       NaN
2013-01-05  1.828942       NaN  0.871194       NaN
2013-01-06       NaN       NaN       NaN  0.279765

Using the <a target="_blank" href="https://pandas.pydata.org/docs/reference/api/pandas.Series.isin.html#pandas.Series.isin">`isin()`</a> method for filtering:

In [59]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  0.321983  1.329344  0.471810  0.735881    one
2013-01-02 -0.518337  0.347907 -0.926087  0.955489    one
2013-01-03  1.503177  0.616035 -0.698710  0.791975    two
2013-01-04  1.493350  0.586334 -0.789059 -0.006325  three
2013-01-05  1.828942 -0.346639  0.871194 -0.821000   four
2013-01-06 -0.395603 -0.293618 -0.795951  0.279765  three

In [60]:
df2[df2["E"].isin(["two", "four"])]

# checks to see if "two" and "four" are in df2["E"] column

                   A         B         C         D     E
2013-01-03  1.503177  0.616035 -0.698710  0.791975   two
2013-01-05  1.828942 -0.346639  0.871194 -0.821000  four

### Setting

Setting a new column automatically aligns the data by the indexes:

In [ ]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

In [ ]:
df["F"] = s1

Setting values by label:

In [ ]:
df.at[dates[0], "A"] = 0

Setting values by position:

In [ ]:
df.iat[0, 1] = 0

Setting by assigning with a NumPy array:

In [ ]:
df.loc[:, "D"] = np.array([5] * len(df))

The result of the prior setting operations:

In [ ]:
df

A `where` operation with setting:

In [ ]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

#### ðŸ‘‰ Save your work here

## Missing data

pandas primarily uses the `np.nan` to represent missing data. It is by default not included in computations. See the [Missing Data](https://pandas.pydata.org/docs/user_guide/missing_data.html#missing-data) section.

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data:

In [ ]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ['E'])
df1.loc[dates[0] : dates[1], 'E'] = 1
df1

[`DataFrame.dropna()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dropna.html#pandas.DataFrame.dropna) drops any rows that have missing data:

In [ ]:
df1.dropna(how='any')

[`DataFrame.fillna()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html#pandas.DataFrame.fillna) fills missing data:

In [ ]:
df1.fillna(value=5)

[`isna()`](https://pandas.pydata.org/docs/reference/api/pandas.isna.html#pandas.isna) gets the boolean mask where values are `nan`:

In [ ]:
pd.isna(df)

## Operations

See the [Basic section on Binary Ops](https://pandas.pydata.org/docs/user_guide/basics.html#basics-binop).

### Stats

Operations in general *exclude* missing data.

Performing a descriptive statistic:

In [ ]:
df.mean()

Same operation on the other axis:

In [ ]:
df.mean(1)

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically
broadcasts along the specified dimension

In [ ]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates).shift(2)
s

In [ ]:
df.sub(s, axis='index')

### Apply

[`DataFrame.apply()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html#pandas.DataFrame.apply) applies a user defined function to the data:

In [ ]:
df.apply(np.cumsum)

In [ ]:
df.apply(lambda x: x.max() - x.min())

### Histogramming

See more at [Histogramming and Discretization](https://pandas.pydata.org/docs/user_guide/basics.html#basics-discretization).

In [ ]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

In [ ]:
s.value_counts()

### String Methods

Series is equipped with a set of string processing methods in the `str` attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in `str` generally uses [regular expressions](https://docs.python.org/3/library/re.html) by default (and in some cases always uses them). See more at [Vectorized String Methods](https://pandas.pydata.org/docs/user_guide/text.html#text-string-methods).

In [ ]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

#### ðŸ‘‰ Save your work here

## Merge

### Concat

pandas provides various facilities for easily combining together Series and DataFrame objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the [Merging section](https://pandas.pydata.org/docs/user_guide/merging.html#merging).

Concatenating pandas objects together along an axis with [`concat()`](https://pandas.pydata.org/docs/reference/api/pandas.concat.html#pandas.concat):

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4))
df

In [ ]:
# break it onto pieces
pieces = [df[:3], df[3:7], df[7:]]

pd.concat(pieces)

NOTE: Adding a column to a [`DataFrame`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame) is relatively fast. However, adding a row requires a copy, and may be expensive. We recommend passing a pre-built list of records to the [`DataFrame`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame) constructor instead of building a [`DataFrame`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame) by iteratively appending records to it.

### Join

[`merge()`](https://pandas.pydata.org/docs/reference/api/pandas.merge.html#pandas.merge) enables SQL style join types along specific columns. See the [Database style joining](https://pandas.pydata.org/docs/user_guide/merging.html#merging-join) section.

In [ ]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
print(left)
print(right)
pd.merge(left, right, on="key")

Adding a column to a `DataFrame` is relatively fast. However adding a row requires a copy, and may be expensive. It is recorecommended passing a pre-build list of records to the `DataFrame` constructor instead of buildinga `DataFrame` by iteratively appending records to it.

Another example that can be given is:

In [ ]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
print(left)
print(right)
pd.merge(left, right, on="key")

#### ðŸ‘‰ Save your work here

## Grouping

By 'group by' we are referring to a process invloving one or more of the following steps:


*   **Splitting** the data into group base on some criteria
*   **Applying** a function to each group independently

*   **Combining** the results into a data structure

See the [Grouping section](https://pandas.pydata.org/docs/user_guide/groupby.html#groupby).

In [ ]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'bar'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

Grouping and then applying the `sum()` funcion to the resulting group:

In [ ]:
df.groupby('A')[["C", "D"]].sum()

Grouping by multiple columns forms a hierarchical index, and again we can apply the `sum()` function:

In [ ]:
df.groupby(["A", "B"]).sum()

## Reshaping

See the sections on [Hierarchical Indexing](https://pandas.pydata.org/docs/user_guide/advanced.html#advanced-hierarchical) and [Reshaping](https://pandas.pydata.org/docs/user_guide/reshaping.html#reshaping-stacking).

### Stack

In [ ]:
tuples = list(
    zip(
        ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
        ["one", "two", "one", "two", "one", "two", "one", "two"],
    )
)

index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])
df2 = df[:4]
df2

The [`stack()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.stack.html#pandas.DataFrame.stack) method â€œcompressesâ€ a level in the DataFrameâ€™s columns:

In [ ]:
stacked = df2.stack()
stacked

With a â€œstackedâ€ DataFrame or Series (having a [MultiIndex](https://pandas.pydata.org/docs/reference/api/pandas.MultiIndex.html#pandas.MultiIndex) as the `index`), the inverse operation of [`stack()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.stack.html#pandas.DataFrame.stack) is [`unstack()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.unstack.html#pandas.DataFrame.unstack), which by default unstacks the **last level**:

In [ ]:
stacked.unstack()

In [ ]:
stacked.unstack(1)

In [ ]:
stacked.unstack(0)

### Pivot tables

See the section on [Pivot Tables](https://pandas.pydata.org/docs/user_guide/reshaping.html#reshaping-pivot).

In [ ]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
df

[`pivot_table()`](https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html#pandas.pivot_table) pivots a [`DataFrame`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame) specifying the `values`, `index`, and `columns`

In [ ]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

#### ðŸ‘‰ Save your work here

## Time series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the [Time Series](https://pandas.pydata.org/docs/user_guide/timeseries.html#timeseries) section.

In [ ]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample("5Min").sum()

[`Series.tz_localize()`](https://pandas.pydata.org/docs/reference/api/pandas.Series.tz_localize.html#pandas.Series.tz_localize) localizes a time series to a time zone:

In [ ]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")
ts = pd.Series(np.random.randn(len(rng)), rng)
print(ts, "\n")
ts_utc = ts.tz_localize("UTC")
ts_utc

Converting between time span representations:

In [ ]:
rng = pd.date_range("1/1/2012", periods=5, freq="M")
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ps = ts.to_period()
ps

In [ ]:
ps.to_timestamp()

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [ ]:
prng = pd.period_range("1990Q1", "2000Q4", freq="Q-NOV")
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq("M", "e") + 1).asfreq("H", "s") + 9
ts.head()

## Categoricals

pandas can include categorical data in a [`DataFrame`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame). For full docs, see the [categorical introduction](https://pandas.pydata.org/docs/user_guide/categorical.html#categorical) and the [API documentation](https://pandas.pydata.org/docs/reference/arrays.html#api-arrays-categorical).

In [ ]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)
df

Converting the raw grades to a categorical data type:

In [ ]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

Rename the categories to more meaningful names:

In [ ]:
new_categories = ["very good", "good", "very bad"]
df["grade"] = df["grade"].cat.rename_categories(new_categories)
df

Reorder the categories and simultaneously add the missing categories (methods under [`Series.cat()`](https://pandas.pydata.org/docs/reference/api/pandas.Series.cat.html#pandas.Series.cat) return a new [`Series`](https://pandas.pydata.org/docs/reference/api/pandas.Series.html#pandas.Series) by default):

In [ ]:
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)
df["grade"]

Sorting is per order in the categories, not lexical order:

In [ ]:
df.sort_values(by="grade")

Grouping by a categorical column also shows empty categories:

In [ ]:
df.groupby("grade").size()

## Plotting

See the [Plotting](https://pandas.pydata.org/docs/user_guide/visualization.html#visualization) docs.

We use the standard convention for referencing the matplotlib API:

In [ ]:
import matplotlib.pyplot as plt
plt.close("all")

ts = pd.Series(np.random.randn(1000), index=pd.date_range("1/1/2000", periods=1000))
ts = ts.cumsum()
ts.plot();

If running under Jupyter Notebook, the plot will appear on [`plot()`](https://pandas.pydata.org/docs/reference/api/pandas.Series.plot.html#pandas.Series.plot). Otherwise use [`matplotlib.pyplot.show`](https://matplotlib.org/3.1.1/api/_as_gen/matplotlib.pyplot.show.html) to show it or [`matplotlib.pyplot.savefig`](https://matplotlib.org/3.1.1/api/_as_gen/matplotlib.pyplot.savefig.html) to write it to a file.

On a DataFrame, the [`plot()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.plot.html#pandas.DataFrame.plot) method is a convenience to plot all of the columns with labels:

In [ ]:
df = pd.DataFrame(
    np.random.randn(1000, 4), index=ts.index, columns=["A", "B", "C", "D"]
)

df = df.cumsum()
plt.figure();
df.plot();
plt.legend(loc='best');

#### ðŸ‘‰ Save your work here

## Importing and exporting data

### CSV

[Writing to a csv file](https://pandas.pydata.org/docs/user_guide/io.html#io-store-in-csv): using [`DataFrame.to_csv()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html#pandas.DataFrame.to_csv)

In [ ]:
df.to_csv("foo.csv")

[Reading from a csv file](https://pandas.pydata.org/docs/user_guide/io.html#io-read-csv-table): using [`read_csv()`](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html#pandas.read_csv)

In [ ]:
pd.read_csv("foo.csv")

### HDF5

Reading and writing to [HDFStores](https://pandas.pydata.org/docs/user_guide/io.html#io-hdf5).

Writing to a HDF5 Store using [`DataFrame.to_hdf()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_hdf.html#pandas.DataFrame.to_hdf):

In [ ]:
df.to_hdf("foo.h5", "df")

Reading from a HDF5 Store using [`read_hdf()`](https://pandas.pydata.org/docs/reference/api/pandas.read_hdf.html#pandas.read_hdf):

In [ ]:
pd.read_hdf("foo.h5", "df")

### Excel

Reading and writing to [Excel](https://pandas.pydata.org/docs/user_guide/io.html#io-excel).

Writing to an excel file using [`DataFrame.to_excel()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_excel.html#pandas.DataFrame.to_excel):

In [ ]:
df.to_excel("foo.xlsx", sheet_name="Sheet1")

Reading from an excel file using [`read_excel()`](https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html#pandas.read_excel):

In [ ]:
pd.read_excel("foo.xlsx", "Sheet1", index_col=None, na_values=["NA"])

## Gotchas

If you are attempting to perform a boolean operation on a [`Series`](https://pandas.pydata.org/docs/reference/api/pandas.Series.html#pandas.Series) or [`DataFrame`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame) you might see an exception like:

In [ ]:
if pd.Series([False, True, False]):
     print("I was true")

See [Comparisons](https://pandas.pydata.org/docs/user_guide/basics.html#basics-compare) and [Gotchas](https://pandas.pydata.org/docs/user_guide/gotchas.html#gotchas) for an explanation and what to do.

#### ðŸ‘‰ Save your work here